## История олимпийских игр

Данные содержат следующие признаки:

* ID - Unique number for each athlete
* Name - Athlete's name
* Sex - M or F
* Age - Integer
* Height - In centimeters
* Weight - In kilograms
* Team - Team name
* NOC - National Olympic Committee 3-letter code
* Games - Year and season
* Year - Integer
* Season - Summer or Winter
* City - Host city
* Sport - Sport
* Event - Event
* Medal - Gold, Silver, Bronze, or NA

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('athlete_events.csv')
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

**1. Сколько лет было самым молодым участникам (мужчина и женщина) олимпийских игр в 1992 году?**

In [10]:
data[data['Year'] == 1992].groupby('Sex')[['Age']].min()

      Age
Sex
F    12.0
M    11.0

__2. Найдите среднее для роста теннисисток (большой теннис), которые участвовали в играх 2000 года.__

In [23]:
round(data[(data['Year'] == 1992) & (data['Sex'] == 'F') & (data['Sport'] == 'Tennis')]['Height'].mean(), 2)

171.28

__3. Выведите названия всех уникальных дисциплин, связанных с катанием на коньках (Skating). Посчитайте их количество__

In [60]:
data['Sport_Skating'] = data['Sport'].apply(lambda x: True if x.find('Skating')>=0 else False)
data[data['Sport_Skating']]['Sport'].unique()

array(['Speed Skating', 'Figure Skating', 'Short Track Speed Skating'],
      dtype=object)

In [61]:
data[data['Sport_Skating']]['Sport'].nunique()

3

__4. Выведите всех спортсменов, которые завоевали серебрянные медали в Париже. Посчитайте их количество__

In [67]:
data[(data['City'] == 'Paris') & (data['Medal'] == 'Silver')]['Name']

663                Max "Xam" Abegglen
917           Harold Maurice Abrahams
2403                   Anselm Ahlfors
2637                     Franz Aigner
4017                   Auguste Albert
                     ...
261463             Frank Henry Wilson
262731            William "Bill" Wood
263619    Paul H. (-Paul Knuth) Wyatt
265263              Jack Butler Yeats
271010                  Anton Zwerina
Name: Name, Length: 509, dtype: object

In [73]:
data[(data['City'] == 'Paris') & (data['Medal'] == 'Silver')]['Name'].count()

509

__5. Найдите самую легкую (по весу) атлетку игр 2006 года. В каком виде спорта она участвовала?__

In [89]:
data[(data['Year'] == 2006) & (data['Sex'] == 'F')].sort_values(by=['Height']).iloc[[0]]['Sport']

226207    Figure Skating
Name: Sport, dtype: object

__6. В скольких олимпиадах принимал участие John Aalberg?__

In [94]:
data[(data['Name'] == 'John Aalberg')]['Games'].nunique()

2

__7. Сколько золотых медалей настольном теннисе выиграл Китай на Олимпиаде в 2008 году?__

In [100]:
data[(data['Year'] == 2008) & (data['Team'] == 'China') & (data['Sport'] == 'Table Tennis') & (data['Medal'] == 'Gold')]['ID'].count()

8

In [74]:
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Sport_Skating
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,False
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,False
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,False
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,False
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,True

__8. Правда ли, что Испания выиграла меньше медалей чем Италия на играх 2016 года? Не учитывайте NaN в колонке _Medal_.__

In [120]:
dct_med = dict(data[(data['Year'] == 2016) & ((data['Team'] == 'Spain') | (data['Team'] == 'Italy'))].groupby('Team')['Medal'].count())
dct_med
dct_med['Spain'] < dct_med['Italy']

True

__9. Какая страна завоевала больше всех медалей в Figure Skating за всю историю?__

In [155]:
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Sport_Skating,Cnt_Medal_Figure
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,False,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,False,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,False,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,False,NaN
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,True,NaN

In [140]:
data[data['Sport'] == 'Figure Skating'].groupby('Team')['Medal'].count().reset_index().sort_values(by=['Medal'], ascending = False)

                Team  Medal
95     United States     46
11            Canada     25
70          Russia-1     22
79    Soviet Union-1     22
69            Russia     20
..               ...    ...
49         Hungary-2      0
46   Great Britain-3      0
42         Germany-3      0
41         Germany-2      0
106       Yugoslavia      0

[107 rows x 2 columns]

In [157]:
df_NOC_TeamCnt = data[['Team','NOC']].drop_duplicates().groupby('NOC').count().reset_index()

In [158]:
df_NOC_TeamCnt

     NOC  Team
0    AFG     1
1    AHO     1
2    ALB     1
3    ALG     1
4    AND     1
..   ...   ...
225  YEM     1
226  YMD     1
227  YUG     6
228  ZAM     1
229  ZIM     2

[230 rows x 2 columns]

In [159]:
df_NOC_TeamCnt[df_NOC_TeamCnt['Team']>1]

     NOC  Team
7    ANZ     2
8    ARG    18
12   AUS    23
13   AUT    12
15   BAH    10
..   ...   ...
217  UZB     3
219  VEN     2
223  WIF     2
227  YUG     6
229  ZIM     2

[83 rows x 2 columns]

In [ ]:
data[['Team','NOC']].drop_duplicates()

In [144]:
data[['Team','NOC']].drop_duplicates().groupby('NOC').count()

     Team
NOC
AFG   126
AHO    79
ALB    70
ALG   551
AND   169
..    ...
YEM    32
YMD     5
YUG  2583
ZAM   183
ZIM   311

[230 rows x 1 columns]

In [141]:
data

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Sport_Skating,Cnt_Medal_Figure
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,False,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,False,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,False,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,False,NaN
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,True,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271111,135569,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,1976,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN,False,NaN
271112,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN,False,NaN
271113,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN,False,NaN
271114,135571,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN,False,NaN
271115,135571,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN,False,NaN

In [156]:
del data['Cnt_Medal_Figure']

In [137]:
data['Cnt_Medal_Figure'] = data[data['Sport'] == 'Figure Skating'].groupby('Team')['Medal'].count()

In [127]:
data_Figure_Grp = data[data['Sport'] == 'Figure Skating'].groupby('Team')['Medal'].count()

In [132]:
data_Figure_Grp.columns

AttributeError: 'Series' object has no attribute 'columns'

In [135]:
data_Figure_Grp.sort_values(by=['Team'])

TypeError: Series.sort_values() got an unexpected keyword argument 'by'

In [130]:
data_Figure_Grp.shape

(107,)

In [ ]:
.sort_value(by)